programming/go/go_package.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: Go Package

* =builtin=

|          | =len()=    |                                       |
|----------+------------+---------------------------------------|
| *序列*   | =append()= | 向分片中添加元素                      |
|          | =copy()=   |                                       |
|          | =delete()= |                                       |
|----------+------------+---------------------------------------|
| *实例化* | =new()=    | 实例化类型，返回指针                  |
|          | =make()=   | 实例化引用类型（slice, map, channel） |

** =append()=

#+BEGIN_SRC go
func append(
    slice []Type
,   elems ...Type
) []Type
#+END_SRC

#+CAPTION: 超出分片容量时，会为分片分配新的（更大的）数组
#+BEGIN_SRC go
var s []int            // len = 0, cap = 0, []
s = append(s, 0)       // len = 1, cap = 2, [0]
s = append(s, 1)       // len = 2, cap = 2, [0 1]
s = append(s, 2, 3, 4) // len = 5, cap = 8, [0 1 2 3 4]
#+END_SRC

#+CAPTION: =append()= 返回新的分片，原分片保持不变
#+BEGIN_SRC go
a := []int{1, 2, 3}
b := append(a, 4)
// a -> [1 2 3]
// b -> [1 2 3 4]
#+END_SRC

** =copy()=

#+BEGIN_SRC go
copy (
    dst
,   src []Type
)
#+END_SRC

#+CAPTION: 示例
#+BEGIN_SRC go
a := []int{1, 2, 3}
b := make([]int, len(a))
copy(b, a)
#+END_SRC

** =delete()=

#+BEGIN_SRC go
func delete(
    m map[Type]Type1
,   key Type
)
#+END_SRC

** =len()=

| *参数*                   | *返回值* |
|--------------------------+----------|
| 数组（指针）、分片、映射 | 元素个数 |
|--------------------------+----------|
| 字符串                   | 字节数   |

** =make()=

实例初始化为零值。

#+BEGIN_SRC go
func make(
    t Type
,   size ...IntegerType
) Type
#+END_SRC

#+CAPTION: 示例
#+BEGIN_SRC go
a := make([]int, 5)    // len = 5, [0 0 0 0 0]
b := make([]int, 0, 5) // len = 0, cap = 5, []
c := make([][]int, 3)
for i = 0; i < 3; i++ {
    c[i] = make([]int, 4)
}
#+END_SRC

** =new()=

#+BEGIN_SRC go
func new(Type) *Type
#+END_SRC

实例初始化为零值。

#+CAPTION: =new()= 等价于声明变量并获取其地址：
#+BEGIN_SRC go
p = new(int)
*p = 1
// 等价于
i := 1
p := &i
#+END_SRC

* =fmt=

| *输出* | =Printf()=  |   |
|        | =Println()= |   |
|--------+-------------+---|
| *输入* | =Scan()=    |   |
|        | =Scanf()=   |   |

