programming/go/go_package.org
** =Get()=

#+BEGIN_SRC go
func Get(
    url string
) (resp *Response, err error)
#+END_SRC

* =os=

| *环境* | =Getenv()=  | 返回环境变量     |
|        | =Setenv()=  | 设定环境变量     |
|        | =Environ()= | 返回所有环境变量 |
|--------+-------------+------------------|
| *文件* | =Open=      |                  |
|        | =Remove()=  |                  |

** 变量

#+BEGIN_SRC go
var (
    Stdin  = NewFile(uintptr(syscall.Stdin), "/dev/stdin")
    Stdout = NewFile(uintptr(syscall.Stdout), "/dev/stdout")
    Stderr = NewFile(uintptr(syscall.Stderr), "/dev/stderr")
)
#+END_SRC

#+CAPTION: 示例
#+BEGIN_SRC go
resp, _ := http.Get("http://golang.org")
io.Copy(os.Stdout, resp.Body)
#+END_SRC

** =Args=

命令行参数数组，第一个元素是程序路径。

#+BEGIN_SRC go
func main() {
    fmt.Println(os.Args[1:])
}
// $ go run main.go 1 2 3
// [1 2 3]
#+END_SRC

** =Environ()=

#+BEGIN_SRC go
func main() {
    for _, e := range os.Environ() {
        pair := strings.Split(e, "=") // 返回格式为 key=value
        fmt.Println(pair[0])
    } 
}
// $ go run main.go
// PATH
// SHELL
// ...
#+END_SRC

** =Exit()=

#+BEGIN_SRC go
func Exit(code int)
#+END_SRC

** =Getenv()=

#+BEGIN_SRC go
func main() {
    fmt.Println("FOO =", os.Getenv("FOO"))
}
// $ FOO=1 go run main.go
// FOO = 1
#+END_SRC

** =Open=

#+BEGIN_SRC go
func Open(name string) (*File, error)
#+END_SRC

#+BEGIN_SRC go
file, _ := os.Open(filename)
io.Copy(os.Stdout, file)
#+END_SRC

** =Remove()=

#+BEGIN_SRC go
func Remove(name string) error
#+END_SRC

* =sort=
** =IntsAreSorted()=

#+BEGIN_SRC go
func IntsAreSorted(a []int) bool
#+END_SRC

返回 =true= 如果整数数组是正序排序的。

#+BEGIN_SRC go
sort.IntsAreSorted([]int{1, 2, 3, 4, 5, 6}) // true
sort.IntsAreSorted([]int{3, 2, 4, 1, 5, 6}) // false
#+END_SRC

* =strings=
** =Join()=

#+BEGIN_SRC go
func Join(
    a []string
,   sep string
) string
#+END_SRC

** =Split()=

#+BEGIN_SRC go
func Split(
    s string
,   sep string
) []string
#+END_SRC

* =testing=
** =testing.T=

#+BEGIN_SRC go
func TestFoo(t *testing.T) {
}
#+END_SRC

*** =Errorf()=

#+BEGIN_SRC go
func (c *T) Errorf(
    format string
,   args ...interface{}
)
#+END_SRC

#+BEGIN_SRC go
func TestFoo(t *testing.T) {
    if (<expr>) {
        t.Errorf("Expected ...", ...)
    }
}
#+END_SRC

* =time=

| =Now()=                        |   |
|--------------------------------+---|
| =Year()= =Month()= =Day()=     |   |
|--------------------------------+---|
| =Hour()= =Minute()= =Second()= |   |
|--------------------------------+---|
| =YearDay()= =WeekDay()=        |   |

** 常量

#+BEGIN_SRC go
const (
    Nanosecond  Duration = 1
    Microsecond          = 1000 * Nanosecond
    Millisecond          = 1000 * Microsecond
    Second               = 1000 * Millisecond
    Minute               = 60 * Second
    Hour                 = 60 * Minute
)
#+END_SRC

** =Now()=

#+BEGIN_SRC go
func Now() Time
#+END_SRC

