programming/go/go_package.html

<div id="outline-container-org44aaaf2" class="outline-2">
<h2 id="org44aaaf2"><span class="section-number-2">7</span> <code>net/http</code></h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgc472de8" class="outline-3">
<h3 id="orgc472de8"><span class="section-number-3">7.1</span> <code>Get()</code></h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">Get</span>(
    url <span class="org-type">string</span>
) (resp *<span class="org-type">Response</span>, err <span class="org-type">error</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcc49460" class="outline-2">
<h2 id="orgcc49460"><span class="section-number-2">8</span> <code>os</code></h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>环境</b></th>
<th scope="col" class="org-left"><code>Getenv()</code></th>
<th scope="col" class="org-left">返回环境变量</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>Setenv()</code></th>
<th scope="col" class="org-left">设定环境变量</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>Environ()</code></th>
<th scope="col" class="org-left">返回所有环境变量</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>文件</b></td>
<td class="org-left"><code>Open</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Remove()</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orge4b2fa4" class="outline-3">
<h3 id="orge4b2fa4"><span class="section-number-3">8.1</span> 变量</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">var</span> (
    Stdin  = <span class="org-function-name">NewFile</span>(<span class="org-function-name">uintptr</span>(syscall.Stdin), <span class="org-string">"/dev/stdin"</span>)
    Stdout = <span class="org-function-name">NewFile</span>(<span class="org-function-name">uintptr</span>(syscall.Stdout), <span class="org-string">"/dev/stdout"</span>)
    Stderr = <span class="org-function-name">NewFile</span>(<span class="org-function-name">uintptr</span>(syscall.Stderr), <span class="org-string">"/dev/stderr"</span>)
)
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 11: </span>示例</label><pre class="src src-go">resp, _ := http.<span class="org-function-name">Get</span>(<span class="org-string">"http://golang.org"</span>)
io.<span class="org-function-name">Copy</span>(os.Stdout, resp.Body)
</pre>
</div>
</div>
</div>

<div id="outline-container-org153f782" class="outline-3">
<h3 id="org153f782"><span class="section-number-3">8.2</span> <code>Args</code></h3>
<div class="outline-text-3" id="text-8-2">
<p>
命令行参数数组，第一个元素是程序路径。
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
    fmt.<span class="org-function-name">Println</span>(os.Args[1:])
}
<span class="org-comment-delimiter">// </span><span class="org-comment">$ go run main.go 1 2 3</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">[1 2 3]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fde17b" class="outline-3">
<h3 id="org8fde17b"><span class="section-number-3">8.3</span> <code>Environ()</code></h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
    <span class="org-keyword">for</span> _, e := <span class="org-keyword">range</span> os.<span class="org-function-name">Environ</span>() {
        pair := strings.<span class="org-function-name">Split</span>(e, <span class="org-string">"="</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">&#36820;&#22238;&#26684;&#24335;&#20026; key=value</span>
        fmt.<span class="org-function-name">Println</span>(pair[0])
    } 
}
<span class="org-comment-delimiter">// </span><span class="org-comment">$ go run main.go</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">PATH</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">SHELL</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef4d6b3" class="outline-3">
<h3 id="orgef4d6b3"><span class="section-number-3">8.4</span> <code>Exit()</code></h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">Exit</span>(code <span class="org-type">int</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc63924e" class="outline-3">
<h3 id="orgc63924e"><span class="section-number-3">8.5</span> <code>Getenv()</code></h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"FOO ="</span>, os.<span class="org-function-name">Getenv</span>(<span class="org-string">"FOO"</span>))
}
<span class="org-comment-delimiter">// </span><span class="org-comment">$ FOO=1 go run main.go</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">FOO = 1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2377b6b" class="outline-3">
<h3 id="org2377b6b"><span class="section-number-3">8.6</span> <code>Open</code></h3>
<div class="outline-text-3" id="text-8-6">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">Open</span>(name <span class="org-type">string</span>) (*<span class="org-type">File</span>, <span class="org-type">error</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-go">file, _ := os.<span class="org-function-name">Open</span>(filename)
io.<span class="org-function-name">Copy</span>(os.Stdout, file)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd18b54" class="outline-3">
<h3 id="orgdd18b54"><span class="section-number-3">8.7</span> <code>Remove()</code></h3>
<div class="outline-text-3" id="text-8-7">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">Remove</span>(name <span class="org-type">string</span>) <span class="org-type">error</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org953f616" class="outline-2">
<h2 id="org953f616"><span class="section-number-2">9</span> <code>sort</code></h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-org8d77c28" class="outline-3">
<h3 id="org8d77c28"><span class="section-number-3">9.1</span> <code>IntsAreSorted()</code></h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">IntsAreSorted</span>(a []<span class="org-type">int</span>) <span class="org-type">bool</span>
</pre>
</div>

<p>
返回 <code>true</code> 如果整数数组是正序排序的。
</p>

<div class="org-src-container">
<pre class="src src-go">sort.<span class="org-function-name">IntsAreSorted</span>([]<span class="org-type">int</span>{1, 2, 3, 4, 5, 6}) <span class="org-comment-delimiter">// </span><span class="org-comment">true</span>
sort.<span class="org-function-name">IntsAreSorted</span>([]<span class="org-type">int</span>{3, 2, 4, 1, 5, 6}) <span class="org-comment-delimiter">// </span><span class="org-comment">false</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org07298ff" class="outline-2">
<h2 id="org07298ff"><span class="section-number-2">10</span> <code>strings</code></h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-org1a39e64" class="outline-3">
<h3 id="org1a39e64"><span class="section-number-3">10.1</span> <code>Join()</code></h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">Join</span>(
    a []<span class="org-type">string</span>
,   sep <span class="org-type">string</span>
) <span class="org-type">string</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org544bf51" class="outline-3">
<h3 id="org544bf51"><span class="section-number-3">10.2</span> <code>Split()</code></h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">Split</span>(
    s <span class="org-type">string</span>
,   sep <span class="org-type">string</span>
) []<span class="org-type">string</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgda2af07" class="outline-2">
<h2 id="orgda2af07"><span class="section-number-2">11</span> <code>testing</code></h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-orgcdfee75" class="outline-3">
<h3 id="orgcdfee75"><span class="section-number-3">11.1</span> <code>testing.T</code></h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">TestFoo</span>(t *<span class="org-type">testing.T</span>) {
}
</pre>
</div>
</div>

<div id="outline-container-orge7bcb75" class="outline-4">
<h4 id="orge7bcb75"><span class="section-number-4">11.1.1</span> <code>Errorf()</code></h4>
<div class="outline-text-4" id="text-11-1-1">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> (c *<span class="org-type">T</span>) <span class="org-function-name">Errorf</span>(
    format <span class="org-type">string</span>
,   args ...<span class="org-keyword">interface</span>{}
)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">TestFoo</span>(t *<span class="org-type">testing.T</span>) {
    <span class="org-keyword">if</span> (&lt;expr&gt;) {
        t.<span class="org-function-name">Errorf</span>(<span class="org-string">"Expected ..."</span>, ...)
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org7cc9814" class="outline-2">
<h2 id="org7cc9814"><span class="section-number-2">12</span> <code>time</code></h2>
<div class="outline-text-2" id="text-12">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>Now()</code></th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>Year()</code> <code>Month()</code> <code>Day()</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>Hour()</code> <code>Minute()</code> <code>Second()</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>YearDay()</code> <code>WeekDay()</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org268a86d" class="outline-3">
<h3 id="org268a86d"><span class="section-number-3">12.1</span> 常量</h3>
<div class="outline-text-3" id="text-12-1">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">const</span> (
    Nanosecond  Duration = 1
    Microsecond          = 1000 * Nanosecond
    Millisecond          = 1000 * Microsecond
    Second               = 1000 * Millisecond
    Minute               = 60 * Second
    Hour                 = 60 * Minute
)
</pre>
</div>
</div>
</div>
